---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewDisplayBackgroundType.SunAndClouds
enum: Autodesk.Revit.DB.ViewDisplayBackgroundType
source: html/e18503c2-b9bc-0c87-9e5d-0fb47644aaa9.htm
---
# Autodesk.Revit.DB.ViewDisplayBackgroundType.SunAndClouds

Best approximation to the colors of the sky and the visible sun disk.
 The position of the visible sun disk is calculated based on the "sun and shadow settings"
 (see 'ViewBackgroundLighting' object).